Hotvini/display_recirc/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define IOCON_PIO_DACMODE_DI 0x00u /*!<@brief Disables DAC mode */
#define IOCON_PIO_HYS_EN 0x20u     /*!<@brief Enable hysteresis */
#define IOCON_PIO_INV_DI 0x00u     /*!<@brief Input not invert */
#define IOCON_PIO_MODE_INACT 0x00u /*!<@brief No addition pin function */
#define IOCON_PIO_OD_DI 0x00u      /*!<@brief Disables Open-drain function */

/*!
 * @brief Hysteresis.: Disable */
#define PIO0_0_HYS_DISABLE 0x00u
/*!
 * @brief
 * Selects function mode (on-chip pull-up/pull-down resistor control).
 * : Inactive.
 * Inactive (no pull-down/pull-up resistor enabled).
 */
#define PIO0_0_MODE_INACTIVE 0x00u
/*!
 * @brief Hysteresis.: Disable */
#define PIO0_10_HYS_DISABLE 0x00u
/*!
 * @brief
 * Selects function mode (on-chip pull-up/pull-down resistor control).
 * : Inactive.
 * Inactive (no pull-down/pull-up resistor enabled).
 */
#define PIO0_10_MODE_INACTIVE 0x00u
/*!
 * @brief Hysteresis.: Disable */
#define PIO0_11_HYS_DISABLE 0x00u
/*!
 * @brief
 * Selects function mode (on-chip pull-up/pull-down resistor control).
 * : Inactive.
 * Inactive (no pull-down/pull-up resistor enabled).
 */
#define PIO0_11_MODE_INACTIVE 0x00u
/*!
 * @brief Hysteresis.: Disable */
#define PIO0_13_HYS_DISABLE 0x00u
/*!
 * @brief
 * Selects function mode (on-chip pull-up/pull-down resistor control).
 * : Inactive.
 * Inactive (no pull-down/pull-up resistor enabled).
 */
#define PIO0_13_MODE_INACTIVE 0x00u
/*!
 * @brief Hysteresis.: Disable */
#define PIO0_14_HYS_DISABLE 0x00u
/*!
 * @brief
 * Selects function mode (on-chip pull-up/pull-down resistor control).
 * : Inactive.
 * Inactive (no pull-down/pull-up resistor enabled).
 */
#define PIO0_14_MODE_INACTIVE 0x00u
/*!
 * @brief Hysteresis.: Disable */
#define PIO0_15_HYS_DISABLE 0x00u
/*!
 * @brief
 * Selects function mode (on-chip pull-up/pull-down resistor control).
 * : Inactive.
 * Inactive (no pull-down/pull-up resistor enabled).
 */
#define PIO0_15_MODE_INACTIVE 0x00u
/*!
 * @brief Hysteresis.: Disable */
#define PIO0_16_HYS_DISABLE 0x00u
/*!
 * @brief
 * Selects function mode (on-chip pull-up/pull-down resistor control).
 * : Inactive.
 * Inactive (no pull-down/pull-up resistor enabled).
 */
#define PIO0_16_MODE_INACTIVE 0x00u
/*!
 * @brief Hysteresis.: Disable */
#define PIO0_17_HYS_DISABLE 0x00u
/*!
 * @brief
 * Selects function mode (on-chip pull-up/pull-down resistor control).
 * : Inactive.
 * Inactive (no pull-down/pull-up resistor enabled).
 */
#define PIO0_17_MODE_INACTIVE 0x00u
/*!
 * @brief Hysteresis.: Disable */
#define PIO0_18_HYS_DISABLE 0x00u
/*!
 * @brief
 * Selects function mode (on-chip pull-up/pull-down resistor control).
 * : Inactive.
 * Inactive (no pull-down/pull-up resistor enabled).
 */
#define PIO0_18_MODE_INACTIVE 0x00u
/*!
 * @brief Hysteresis.: Disable */
#define PIO0_19_HYS_DISABLE 0x00u
/*!
 * @brief
 * Selects function mode (on-chip pull-up/pull-down resistor control).
 * : Inactive.
 * Inactive (no pull-down/pull-up resistor enabled).
 */
#define PIO0_19_MODE_INACTIVE 0x00u
/*!
 * @brief Hysteresis.: Disable */
#define PIO0_1_HYS_DISABLE 0x00u
/*!
 * @brief
 * Selects function mode (on-chip pull-up/pull-down resistor control).
 * : Inactive.
 * Inactive (no pull-down/pull-up resistor enabled).
 */
#define PIO0_1_MODE_INACTIVE 0x00u
/*!
 * @brief Hysteresis.: Disable */
#define PIO0_20_HYS_DISABLE 0x00u
/*!
 * @brief
 * Selects function mode (on-chip pull-up/pull-down resistor control).
 * : Inactive.
 * Inactive (no pull-down/pull-up resistor enabled).
 */
#define PIO0_20_MODE_INACTIVE 0x00u
/*!
 * @brief Hysteresis.: Disable */
#define PIO0_21_HYS_DISABLE 0x00u
/*!
 * @brief
 * Selects function mode (on-chip pull-up/pull-down resistor control).
 * : Inactive.
 * Inactive (no pull-down/pull-up resistor enabled).
 */
#define PIO0_21_MODE_INACTIVE 0x00u
/*!
 * @brief Hysteresis.: Disable */
#define PIO0_22_HYS_DISABLE 0x00u
/*!
 * @brief
 * Selects function mode (on-chip pull-up/pull-down resistor control).
 * : Inactive.
 * Inactive (no pull-down/pull-up resistor enabled).
 */
#define PIO0_22_MODE_INACTIVE 0x00u
/*!
 * @brief Hysteresis.: Disable */
#define PIO0_23_HYS_DISABLE 0x00u
/*!
 * @brief
 * Selects function mode (on-chip pull-up/pull-down resistor control).
 * : Inactive.
 * Inactive (no pull-down/pull-up resistor enabled).
 */
#define PIO0_23_MODE_INACTIVE 0x00u
/*!
 * @brief Hysteresis.: Disable */
#define PIO0_24_HYS_DISABLE 0x00u
/*!
 * @brief
 * Selects function mode (on-chip pull-up/pull-down resistor control).
 * : Inactive.
 * Inactive (no pull-down/pull-up resistor enabled).
 */
#define PIO0_24_MODE_INACTIVE 0x00u
/*!
 * @brief Hysteresis.: Disable */
#define PIO0_25_HYS_DISABLE 0x00u
/*!
 * @brief
 * Selects function mode (on-chip pull-up/pull-down resistor control).
 * : Inactive.
 * Inactive (no pull-down/pull-up resistor enabled).
 */
#define PIO0_25_MODE_INACTIVE 0x00u
/*!
 * @brief Hysteresis.: Disable */
#define PIO0_26_HYS_DISABLE 0x00u
/*!
 * @brief
 * Selects function mode (on-chip pull-up/pull-down resistor control).
 * : Inactive.
 * Inactive (no pull-down/pull-up resistor enabled).
 */
#define PIO0_26_MODE_INACTIVE 0x00u
/*!
 * @brief Hysteresis.: Disable */
#define PIO0_27_HYS_DISABLE 0x00u
/*!
 * @brief
 * Selects function mode (on-chip pull-up/pull-down resistor control).
 * : Inactive.
 * Inactive (no pull-down/pull-up resistor enabled).
 */
#define PIO0_27_MODE_INACTIVE 0x00u
/*!
 * @brief Hysteresis.: Disable */
#define PIO0_28_HYS_DISABLE 0x00u
/*!
 * @brief
 * Selects function mode (on-chip pull-up/pull-down resistor control).
 * : Inactive.
 * Inactive (no pull-down/pull-up resistor enabled).
 */
#define PIO0_28_MODE_INACTIVE 0x00u
/*!
 * @brief Hysteresis.: Disable */
#define PIO0_29_HYS_DISABLE 0x00u
/*!
 * @brief
 * Selects function mode (on-chip pull-up/pull-down resistor control).
 * : Inactive.
 * Inactive (no pull-down/pull-up resistor enabled).
 */
#define PIO0_29_MODE_INACTIVE 0x00u
/*!
 * @brief Hysteresis.: Disable */
#define PIO0_30_HYS_DISABLE 0x00u
/*!
 * @brief
 * Selects function mode (on-chip pull-up/pull-down resistor control).
 * : Inactive.
 * Inactive (no pull-down/pull-up resistor enabled).
 */
#define PIO0_30_MODE_INACTIVE 0x00u
/*!
 * @brief Hysteresis.: Disable */
#define PIO0_4_HYS_DISABLE 0x00u
/*!
 * @brief Invert input: Input not inverted (HIGH on pin reads as 1; LOW on pin reads as 0). */
#define PIO0_4_INV_NOT_INVERTED 0x00u
/*!
 * @brief
 * Selects function mode (on-chip pull-up/pull-down resistor control).
 * : Inactive.
 * Inactive (no pull-down/pull-up resistor enabled).
 */
#define PIO0_4_MODE_INACTIVE 0x00u
/*!
 * @brief Hysteresis.: Disable */
#define PIO0_7_HYS_DISABLE 0x00u
/*!
 * @brief
 * Selects function mode (on-chip pull-up/pull-down resistor control).
 * : Inactive.
 * Inactive (no pull-down/pull-up resistor enabled).
 */
#define PIO0_7_MODE_INACTIVE 0x00u
/*!
 * @brief Hysteresis.: Disable */
#define PIO0_8_HYS_DISABLE 0x00u
/*!
 * @brief
 * Selects function mode (on-chip pull-up/pull-down resistor control).
 * : Inactive.
 * Inactive (no pull-down/pull-up resistor enabled).
 */
#define PIO0_8_MODE_INACTIVE 0x00u
/*!
 * @brief Hysteresis.: Disable */
#define PIO0_9_HYS_DISABLE 0x00u
/*!
 * @brief
 * Selects function mode (on-chip pull-up/pull-down resistor control).
 * : Inactive.
 * Inactive (no pull-down/pull-up resistor enabled).
 */
#define PIO0_9_MODE_INACTIVE 0x00u

/*! @name PIO0_17 (number 1), NC0
  @{ */

