Hotvini/display_recirc/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_NC0_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_NC0_INIT_GPIO_VALUE 0U        /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_NC0_GPIO_PIN_MASK (1U << 17U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_NC0_PORT 0U                   /*!<@brief PORT device index: 0 */
#define BOARD_INITPINS_NC0_PIN 17U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_NC0_PIN_MASK (1U << 17U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PIO0_13 (number 2), NC1
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_NC1_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_NC1_INIT_GPIO_VALUE 0U        /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_NC1_GPIO_PIN_MASK (1U << 13U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_NC1_PORT 0U                   /*!<@brief PORT device index: 0 */
#define BOARD_INITPINS_NC1_PIN 13U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_NC1_PIN_MASK (1U << 13U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PIO0_27 (number 13), NC2
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_NC2_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_NC2_INIT_GPIO_VALUE 0U        /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_NC2_GPIO_PIN_MASK (1U << 27U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_NC2_PORT 0U                   /*!<@brief PORT device index: 0 */
#define BOARD_INITPINS_NC2_PIN 27U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_NC2_PIN_MASK (1U << 27U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PIO0_26 (number 14), NC3
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_NC3_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_NC3_INIT_GPIO_VALUE 0U        /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_NC3_GPIO_PIN_MASK (1U << 26U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_NC3_PORT 0U                   /*!<@brief PORT device index: 0 */
#define BOARD_INITPINS_NC3_PIN 26U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_NC3_PIN_MASK (1U << 26U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PIO0_20 (number 15), NC4
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_NC4_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_NC4_INIT_GPIO_VALUE 0U        /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_NC4_GPIO_PIN_MASK (1U << 20U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_NC4_PORT 0U                   /*!<@brief PORT device index: 0 */
#define BOARD_INITPINS_NC4_PIN 20U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_NC4_PIN_MASK (1U << 20U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PIO0_30 (number 21), NC5
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_NC5_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_NC5_INIT_GPIO_VALUE 0U        /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_NC5_GPIO_PIN_MASK (1U << 30U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_NC5_PORT 0U                   /*!<@brief PORT device index: 0 */
#define BOARD_INITPINS_NC5_PIN 30U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_NC5_PIN_MASK (1U << 30U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PIO0_7 (number 22), NC6
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_NC6_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_NC6_INIT_GPIO_VALUE 0U       /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_NC6_GPIO_PIN_MASK (1U << 7U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_NC6_PORT 0U                  /*!<@brief PORT device index: 0 */
#define BOARD_INITPINS_NC6_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_NC6_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                    /* @} */

/*! @name PIO0_14 (number 25), STB
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_STB_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_STB_INIT_GPIO_VALUE 1U        /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_STB_GPIO_PIN_MASK (1U << 14U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_STB_PORT 0U                   /*!<@brief PORT device index: 0 */
#define BOARD_INITPINS_STB_PIN 14U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_STB_PIN_MASK (1U << 14U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PIO0_19 (number 26), DIO
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_DIO_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_DIO_INIT_GPIO_VALUE 0U        /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_DIO_GPIO_PIN_MASK (1U << 19U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_DIO_PORT 0U                   /*!<@brief PORT device index: 0 */
#define BOARD_INITPINS_DIO_PIN 19U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_DIO_PIN_MASK (1U << 19U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PIO0_25 (number 27), CLK
  @{ */

