Hotvini/display_recirc/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_CLK_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_CLK_INIT_GPIO_VALUE 0U        /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_CLK_GPIO_PIN_MASK (1U << 25U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_CLK_PORT 0U                   /*!<@brief PORT device index: 0 */
#define BOARD_INITPINS_CLK_PIN 25U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_CLK_PIN_MASK (1U << 25U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PIO0_24 (number 28), LED_S4
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LED_S4_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_LED_S4_INIT_GPIO_VALUE 0U        /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_LED_S4_GPIO_PIN_MASK (1U << 24U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_LED_S4_PORT 0U                   /*!<@brief PORT device index: 0 */
#define BOARD_INITPINS_LED_S4_PIN 24U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_LED_S4_PIN_MASK (1U << 24U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PIO0_23 (number 29), LED_S3
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LED_S3_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_LED_S3_INIT_GPIO_VALUE 0U        /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_LED_S3_GPIO_PIN_MASK (1U << 23U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_LED_S3_PORT 0U                   /*!<@brief PORT device index: 0 */
#define BOARD_INITPINS_LED_S3_PIN 23U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_LED_S3_PIN_MASK (1U << 23U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PIO0_22 (number 30), LED_S2
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LED_S2_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_LED_S2_INIT_GPIO_VALUE 0U        /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_LED_S2_GPIO_PIN_MASK (1U << 22U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_LED_S2_PORT 0U                   /*!<@brief PORT device index: 0 */
#define BOARD_INITPINS_LED_S2_PIN 22U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_LED_S2_PIN_MASK (1U << 22U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PIO0_18 (number 31), LED_S1
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LED_S1_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_LED_S1_INIT_GPIO_VALUE 0U        /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_LED_S1_GPIO_PIN_MASK (1U << 18U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_LED_S1_PORT 0U                   /*!<@brief PORT device index: 0 */
#define BOARD_INITPINS_LED_S1_PIN 18U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_LED_S1_PIN_MASK (1U << 18U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PIO0_16 (number 32), NC7
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_NC7_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_NC7_INIT_GPIO_VALUE 0U        /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_NC7_GPIO_PIN_MASK (1U << 16U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_NC7_PORT 0U                   /*!<@brief PORT device index: 0 */
#define BOARD_INITPINS_NC7_PIN 16U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_NC7_PIN_MASK (1U << 16U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PIO0_15 (number 16), Buzzer
  @{ */
#define BOARD_INITPINS_BUZZER_PORT 0U                   /*!<@brief PORT device index: 0 */
#define BOARD_INITPINS_BUZZER_PIN 15U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_BUZZER_PIN_MASK (1U << 15U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void); /* Function assigned for the Cortex-M0P */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
